www/codeigniter4/app/Controllers/Entregas.php

SELECT `entregas`.*, `vendas`.`venda_id`, `usuarios`.`usuarios_nome`, `usuarios`.`usuarios_sobrenome`, `entregas`.`data_saiu_entrega`, `entregas`.`data_entrega`, `entregas`.`status`
FROM `entregas`
JOIN `vendas` ON `vendas`.`venda_id` = `entregas`.`venda_id`
JOIN `funcionarios` ON `funcionarios`.`funcionario_id` = `entregas`.`funcionario_id`
JOIN `usuarios` ON `usuarios`.`usuarios_id` = `funcionarios`.`usuario_id`
---
    public function index()
    {
        $login = session()->get('login');
        switch ($login->usuarios_nivel ?? null) {
            case 1:
                $template = 'Templates_admin';
                break;
            case 3:
                $template = 'Templates_funcionario';
                break;
            case 0:
                $template = 'Templates_user';
                break;
            default:
                $template = 'Templates';
        }
        $data['template'] = $template;
        $data['entregas'] = (new EntregaModel())
            ->select('entregas.*, vendas.venda_id, usuarios.usuarios_nome, usuarios.usuarios_sobrenome, entregas.data_saiu_entrega, entregas.data_entrega, entregas.status')
            ->join('vendas', 'vendas.venda_id = entregas.venda_id')
            ->join('funcionarios', 'funcionarios.funcionario_id = entregas.funcionario_id')
            ->join('usuarios', 'usuarios.usuarios_id = funcionarios.usuario_id')
            ->findAll();