www/codeigniter4/app/Controllers/Login.php

SELECT *
FROM `usuarios`
WHERE `usuarios_cpf` = 'vilsonsoares@gmail.com'
OR `usuarios_email` = 'vilsonsoares@gmail.com'
AND `usuarios_senha` = 'e10adc3949ba59abbe56e057f20f883e'
---
    public function logar()
    {
        $login = $_REQUEST['login'];
        $senha = md5($_REQUEST['senha']);

        $this->data['usuarios'] = $this->usuarios->where('usuarios_cpf', $login)->
            orWhere('usuarios_email', $login)->where('usuarios_senha', $senha)->find();