www/codeigniter4/app/Controllers/Pedidos.php

        // Se não for admin, mostra só os pedidos do usuário logado
        if ($usuario_nivel != 1 && $usuario_nivel != 3) {
            // Busca o cliente_id correspondente ao usuario_id logado
            $cliente = (new Clientes())->where('usuario_id', $cliente_id_logado)->first();
---
SELECT *
FROM `clientes`
WHERE `usuario_id` = '25'
 LIMIT 1

    public function edit($id)
    {
        $pedidoModel = new PedidoModel();
        $data['form'] = 'Editar';
        $data['op'] = 'update';
        $data['pedido'] = $pedidoModel->find($id);
---
SELECT *
FROM `pedidos`
WHERE `pedidos`.`pedido_id` = '11'

        $data['cliente_id'] = isset($login->usuarios_id) ? $login->usuarios_id : '';
        if ($usuario_nivel != 1 && $usuario_nivel != 3) { // Se não for admin
            // Busca o cliente_id pelo usuario_id logado
            $cliente = (new Clientes())->where('usuario_id', $login->usuarios_id)->first();
---
SELECT *
FROM `clientes`
WHERE `usuario_id` = '25'
 LIMIT 1

        }
        if ($data['isCliente']) {
            // Busca o cliente_id pelo usuario_id logado
            $cliente = (new Clientes())->where('usuario_id', $login->usuarios_id)->first();
            $data['cliente_id'] = $cliente ? $cliente->cliente_id : '';
            $data['enderecos'] = (new \App\Models\Enderecos())
                ->where('usuarios_id', $login->usuarios_id)
                ->findAll();
---
SELECT *
FROM `clientes`
WHERE `usuario_id` = '25'
 LIMIT 1
SELECT *
FROM `enderecos`
WHERE `usuarios_id` = '25'

            // Admin pode editar qualquer pedido
            if ($data['pedido']) {
                $cliente_id = $data['pedido']->cliente_id;
                $cliente = (new \App\Models\Clientes())->find($cliente_id);
                if ($cliente) {
                    $data['enderecos'] = (new \App\Models\Enderecos())
                        ->where('usuarios_id', $cliente->usuario_id)
                        ->findAll();
---
SELECT *
FROM `clientes`
WHERE `clientes`.`cliente_id` = '4'
SELECT *
FROM `enderecos`
WHERE `usuarios_id` = '25'

            }
        }

        $data['clientes'] = (new Clientes())
            ->select('clientes.*, usuarios.usuarios_nome, usuarios.usuarios_sobrenome')
            ->join('usuarios', 'usuarios.usuarios_id = clientes.usuario_id')
            ->findAll();
        $data['itens'] = (new ItensPedidos())
            ->select('itens_pedido.*, produtos.produtos_nome, produtos.produtos_id')
            ->join('produtos', 'produtos.produtos_id = itens_pedido.produtos_produtos_id')
            ->where('itens_pedido.pedidos_pedido_id', $id)
            ->findAll();

        $data['produtos'] = (new ProdutoModel())
            ->select('produtos.*, estoque.quantidade as estoque')
            ->join('estoque', 'estoque.produto_id = produtos.produtos_id', 'left')
            ->findAll();
---
SELECT `clientes`.*, `usuarios`.`usuarios_nome`, `usuarios`.`usuarios_sobrenome`
FROM `clientes`
JOIN `usuarios` ON `usuarios`.`usuarios_id` = `clientes`.`usuario_id`
SELECT `itens_pedido`.*, `produtos`.`produtos_nome`, `produtos`.`produtos_id`
FROM `itens_pedido`
JOIN `produtos` ON `produtos`.`produtos_id` = `itens_pedido`.`produtos_produtos_id`
WHERE `itens_pedido`.`pedidos_pedido_id` = '11'
SELECT `produtos`.*, `estoque`.`quantidade` as `estoque`
FROM `produtos`
LEFT JOIN `estoque` ON `estoque`.`produto_id` = `produtos`.`produtos_id`

    public function show($pedido_id)
    {
        $pedidoModel = new \App\Models\Pedidos();
        $itensPedidoModel = new \App\Models\Itens_Pedido();
        $produtosModel = new \App\Models\Produtos();
        $clientesModel = new \App\Models\Clientes();
        $usuariosModel = new \App\Models\Usuarios();
        $enderecosModel = new \App\Models\Enderecos();
        $entregaModel = new \App\Models\Entrega();

        $pedido = $pedidoModel
            ->select('pedidos.*, clientes.usuario_id, usuarios.usuarios_nome, usuarios.usuarios_sobrenome')
            ->join('clientes', 'clientes.cliente_id = pedidos.cliente_id')
            ->join('usuarios', 'usuarios.usuarios_id = clientes.usuario_id')
            ->where('pedidos.pedido_id', $pedido_id)
            ->first();
---
SELECT `pedidos`.*, `clientes`.`usuario_id`, `usuarios`.`usuarios_nome`, `usuarios`.`usuarios_sobrenome`
FROM `pedidos`
JOIN `clientes` ON `clientes`.`cliente_id` = `pedidos`.`cliente_id`
JOIN `usuarios` ON `usuarios`.`usuarios_id` = `clientes`.`usuario_id`
WHERE `pedidos`.`pedido_id` = '9'
 LIMIT 1


        if ($usuario_nivel != 1 && $usuario_nivel != 3) { // Se não for admin
            // Busca o cliente_id pelo usuario_id logado
            $cliente = (new \App\Models\Clientes())->where('usuario_id', $login->usuarios_id)->first();
---
SELECT *
FROM `clientes`
WHERE `usuario_id` = '25'
 LIMIT 1

            }
        }

        $endereco = $enderecosModel->find($pedido->endereco_id ?? null);

        $itens = $itensPedidoModel->where('pedidos_pedido_id', $pedido_id)->findAll();
        foreach ($itens as &$item) {
            $produto = $produtosModel->find($item->produtos_produtos_id);
---
SELECT *
FROM `enderecos`
WHERE `enderecos`.`enderecos_id` = '6'
SELECT *
FROM `itens_pedido`
WHERE `pedidos_pedido_id` = '9'
SELECT *
FROM `produtos`
WHERE `produtos`.`produtos_id` = '1'