www/codeigniter4/app/Controllers/Vendas.php

    public function index()
    {
        $data['vendas'] = (new VendaModel())
            ->select('vendas.*, pedidos.pedido_id, pedidos.total, usuarios.usuarios_nome, usuarios.usuarios_sobrenome')
            ->join('pedidos', 'pedidos.pedido_id = vendas.pedido_id')
            ->join('clientes', 'clientes.cliente_id = pedidos.cliente_id')
            ->join('usuarios', 'usuarios.usuarios_id = clientes.usuario_id')
            ->findAll();
---
SELECT `vendas`.*, `pedidos`.`pedido_id`, `pedidos`.`total`, `usuarios`.`usuarios_nome`, `usuarios`.`usuarios_sobrenome`
FROM `vendas`
JOIN `pedidos` ON `pedidos`.`pedido_id` = `vendas`.`pedido_id`
JOIN `clientes` ON `clientes`.`cliente_id` = `pedidos`.`cliente_id`
JOIN `usuarios` ON `usuarios`.`usuarios_id` = `clientes`.`usuario_id`